# Реализуйте алгоритм перемешивания списка.



import random 
list = [1, 2, 8, 10, 76, 28, 17, 46]
random.shuffle(list)
print(list)


# С РАНДОМНЫМИ ЗНАЧЕНИЯМИ
# from random import randint
# n = int(input('Введите длину массива: '))
# list = [randint(-100, 100) for i in range(n)]
# print(list) 